rmanosuthi/openbsd_src/share/man/man4/man4.arm64/rpicpu.4
.\"	RCS id goes here
.\"
.\" Copyright (c) 2026 Ron Manosuthi <rman401@proton.me>
.\"
.\" Permission to use, copy, modify, and distribute this software for any
.\" purpose with or without fee is hereby granted, provided that the above
.\" copyright notice and this permission notice appear in all copies.
.\"
.\" THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES
.\" WITH REGARD TO THIS SOFTWARE INCLUDING ALL IMPLIED WARRANTIES OF
.\" MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE FOR
.\" ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES
.\" WHATSOEVER RESULTING FROM LOSS OF USE, DATA OR PROFITS, WHETHER IN AN
.\" ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, ARISING OUT OF
.\" OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
.\"
.Dd $Mdocdate: January 7 2026 $
.Dt RPICPU 4 arm64
.Os
.Sh NAME
.Nm rpicpu
.Nd Raspberry Pi CPU frequency driver
.Sh SYNOPSIS
.Cd "rpicpu* at fdt?"
.Sh DESCRIPTION
The
.Nm
driver enables support for CPU frequency reclocking on Raspberry Pi devices.
.Pp
Currently, the driver is only enabled for the following tested devices:
.Pp
.Bl -bullet -offset indent -compact
.It
Raspberry Pi 4B
.It
Raspberry Pi 400
.El
.Sh SEE ALSO
.Xr bcmclock 4 ,
.Xr intro 4 ,
.Xr apm 8 ,
.Xr apmd 8
.Sh HISTORY
The
.Nm
driver first appeared in
.Ox 7.8 .
.Sh AUTHORS
.An -nosplit
The
.Nm
driver was written by
.An Ron Manosuthi Aq Mt rman401@proton.me .
.Sh CAVEATS
The
.Nm
driver does not handle voltage adjustments or thermal throttling.
.Pp
Sensor reporting has not been implemented.
